{
  "products": [
    {
      "id": 1,
      "name": "Blessing in Disguise: A Novel",
      "description": "As a young intern at an art gallery in Paris, Isabelle McAvoy meets Putnam Armstrong, wealthy, gentle, older, and secluded from the world. Isabelle's relationship with Putnam, and her time at his château on the Normandy coast, are the stuff of dreams. But it turns real when she becomes pregnant, for she knows that marriage is out of the question.",
      "price": "14.11",
      "yearpublished": 1994,
      "pages": "342",
      "language": "English",
      "author": "Danielle Steel",
      "categories": [
        "Fiction",
        "Uncategorized"
      ],
      "image": "/images/img-book-1.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 2,
      "name": "A Lily in the Light",
      "description": "For eleven-year-old Esme, ballet is everything—until her four-year-old sister, Lily, vanishes without a trace and nothing is certain anymore. People Esme has known her whole life suddenly become suspects, each new one hitting closer to home than the last.Unable to cope, Esme escapes the nightmare that is her new reality when she receives an invitation to join an elite ballet academy in San Francisco. Desperate to leave behind her chaotic, broken family and the mystery surrounding Lily's disappearance, Esme accepts.",
      "price": 14.99,
      "yearpublished": 2018,
      "pages": 251,
      "language": "English",
      "author": "Kristin Fields",
      "categories": [
        "Biography"
      ],
      "image": "/images/img-book-2.png",
      "sale": true,
      "quantity": 1
    },
    {
      "id": 3,
      "name": "A Woman Is No Man: A Novel",
      "description": "Where I come from, we've learned to silence ourselves. We've been taught that silence will save us. Where I come from, we keep these stories to ourselves. To tell them to the outside world is unheard of—dangerous, the ultimate shame.",
      "price": 15,
      "yearpublished": 2001,
      "pages": 230,
      "language": "English",
      "author": "Etaf Rum",
      "categories": [
        "Biography",
        "Drama"
      ],
      "image": "/images/img-book-3.png",
      "sale": true,
      "quantity": 1
    },
    {
      "id": 4,
      "name": "Becoming",
      "description": "In a life filled with meaning and accomplishment, Michelle Obama has emerged as one of the most iconic and compelling women of our era. As First Lady of the United States of America, the first African-American to serve in that role, she helped create the most welcoming and inclusive White House in history, while also establishing herself as a powerful advocate for women and girls in the U.S. and around the world.",
      "price": 14.95,
      "yearpublished": 1994,
      "pages": 256,
      "language": "English",
      "author": "Michelle Obama",
      "categories": [
        "Biography"
      ],
      "image": "/images/img-book-4.png",
      "sale": true,
      "quantity": 1
    },
    {
      "id": 5,
      "name": "Born a Crime: Stories from a South African Childhood",
      "description": "Trevor Noah's unlikely path from apartheid South Africa to the desk of The Daily Show began with a criminal act: his birth. Trevor was born to a white Swiss father and a black Xhosa mother at a time when such a union was punishable by five years in prison. Living proof of his parents' indiscretion, Trevor was kept mostly indoors for the earliest years of his life, bound by the extreme and often absurd measures his mother took to hide him from a government that could, at any moment, steal him away. Finally liberated by the end of South Africa's tyrannical white rule, Trevor and his mother set forth on a grand adventure, living openly and freely and embracing the opportunities won by a centuries-long struggle.",
      "price": 13.49,
      "yearpublished": 2019,
      "pages": 316,
      "language": "English",
      "author": "Trevor Noah",
      "categories": [
        "Biography"
      ],
      "image": "/images/img-book-5.png",
      "sale": true,
      "quantity": 1
    },
    {
      "id": 6,
      "name": "Children of Blood and Bone",
      "description": "With five starred reviews, Tomi Adeyemi's West African-inspired fantasy debut, and instant #1 New York Times Bestseller, conjures a world of magic and danger, perfect for fans of Leigh Bardugo and Sabaa Tahir.",
      "price": 60.09,
      "yearpublished": 2018,
      "pages": 554,
      "language": "English",
      "author": "Tomi Adeymi",
      "categories": [
        "Biography",
        "Children's"
      ],
      "image": "/images/img-book-6.png",
      "sale": true,
      "quantity": 1
    },
    {
      "id": 7,
      "name": "Educated",
      "description": "Public education was one of the many things her religious fanatic father was dubious of, believing it a means for the government to brainwash its gullible citizens, and her mother wasn’t diligent on the homeschooling front. If it wasn't for a brother who managed to extricate himself from their isolated and often dangerous world, Westover might still be in rural Idaho, trying to survive her survivalist upbringing.",
      "price": 8.99,
      "yearpublished": 2018,
      "pages": 400,
      "language": "English",
      "author": "Tara Westover",
      "categories": [
        "Biography"
      ],
      "image": "/images/img-book-7.png",
      "sale": true,
      "quantity": 1
    },
    {
      "id": 8,
      "name": "I'm Fine and Neither Are You",
      "description": "Wife. Mother. Breadwinner. Penelope Ruiz-Kar is doing it all—and barely keeping it together. Meanwhile, her best friend, Jenny Sweet, appears to be sailing through life. As close as the two women are, Jenny's passionate marriage, pristine house, and ultra-polite child stand in stark contrast to Penelope's underemployed husband, Sanjay, their unruly brood, and the daily grind she calls a career.Then a shocking tragedy reveals that Jenny's life is far from perfect. Reeling, Penelope vows to stop keeping the peace and finally deal with the issues in her relationship. So she and Sanjay agree to a radical proposal: both will write a list of changes they want each other to make—then commit to complete and total honesty.",
      "price": 10.37,
      "yearpublished": 2019,
      "pages": 270,
      "language": "English",
      "author": "Camille Pagan",
      "categories": [
        "Biography",
        "Children's"
      ],
      "image": "/images/img-book-8.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 9,
      "name": "Invisible Man",
      "description": "A first novel by an unknown writer, it remained on the bestseller list for sixteen weeks, won the National Book Award for fiction, and established Ralph Ellison as one of the key writers of the century. The nameless narrator of the novel describes growing up in a black community in the South, attending a Negro college from which he is expelled, moving to New York and becoming the chief spokesman of the Harlem branch of “the Brotherhood”, and retreating amid violence and confusion to the basement lair of the Invisible Man he imagines himself to be. The book is a passionate and witty tour de force of style, strongly influenced by T.S. Eliot's The Waste Land, Joyce, and Dostoevsky.",
      "price": 14.28,
      "yearpublished": 1994,
      "pages": 251,
      "language": "English",
      "author": "Ralph Ellison",
      "categories": [
        "Biography",
        "Mystery"
      ],
      "image": "/images/img-book-9.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 10,
      "name": "Know Why the Caged Bird Sings",
      "description": "Here is a book as joyous and painful, as mysterious and memorable, as childhood itself. I Know Why the Caged Bird Sings captures the longing of lonely children, the brute insult of bigotry, and the wonder of words that can make the world right. Maya Angelou's debut memoir is a modern American classic beloved worldwide.",
      "price": 11.55,
      "yearpublished": 2005,
      "pages": 300,
      "language": "English",
      "author": "Maya Angelou",
      "categories": [
        "Biography",
        "Family"
      ],
      "image": "/images/img-book-10.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 11,
      "name": "Black Leopard, Red Wolf (The Dark Star Trilogy)",
      "description": "Tracker is known far and wide for his skills as a hunter: “He has a nose,” people say. Engaged to track down a mysterious boy who disappeared three years earlier, Tracker breaks his own rule of always working alone when he finds himself part of a group that comes together to search for the boy. The band is a hodgepodge, full of unusual characters with secrets of their own, including a shape-shifting man-animal known as Leopard.",
      "price": 17,
      "yearpublished": 2019,
      "pages": 640,
      "language": "English",
      "author": "Marlon James",
      "categories": [
        "Children's",
        "Drama",
        "Family"
      ],
      "image": "/images/img-book-11.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 12,
      "name": "It's Kind of a Funny Story",
      "description": "Like many ambitious New York City teenagers, Craig Gilner sees entry into Manhattan's Executive Pre-Professional High School as the ticket to his future. Determined to succeed at life—which means getting into the right high school to get into the right college to get the right job—Craig studies night and day to ace the entrance exam, and does.  That's when things start to get crazy.At his new school, Craig realizes that he isn't brilliant compared to the other kids; he's just average, and maybe not even that. He soon sees his once-perfect future crumbling away. The stress becomes unbearable and Craig stops eating and sleeping—until, one night, he nearly kills himself.",
      "price": 8.99,
      "yearpublished": 2012,
      "pages": 240,
      "language": "English",
      "author": "Nes Vizzini",
      "categories": [
        "Children's"
      ],
      "image": "/images/img-book-12.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 13,
      "name": "Oh, the Places You'll Go!",
      "description": "From soaring to high heights and seeing great sights to being left in a Lurch on a prickle-ly perch, Dr. Seuss addresses life's ups and downs with his trademark humorous verse and illustrations, while encouraging readers to find the success that lies within. In a starred review, Booklist notes, “Seuss's message is simple but never sappy: life may be a 'Great Balancing Act,' but through it all 'There's fun to be done.’” A perennial favorite and a perfect gift for anyone starting a new phase in their life!",
      "price": 15.55,
      "yearpublished": 2005,
      "pages": 197,
      "language": "English",
      "author": "Dr. Seuss",
      "categories": [
        "Children's"
      ],
      "image": "/images/img-book-13.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 14,
      "name": "Wonder",
      "description": "Wonder is a children's novel by Raquel Jaramillo, under the pen name of R. J. Palacio, published on February 14, 2012. R. J. Palacio wrote Wonder after an incident where her son noticed a girl with a severe facial deformity and started to cry.",
      "price": 9.49,
      "yearpublished": 2014,
      "pages": 334,
      "language": "English",
      "author": "R. J. Palacio",
      "categories": [
        "Children's"
      ],
      "image": "/images/img-book-14.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 15,
      "name": "Eat Fat, Get Thin",
      "description": "Many of us have long been told that fat makes us fat, contributes to heart disease, and generally erodes our health. Now a growing body of research is debunking our fat-phobia, revealing the immense health and weight-loss benefits of a high-fat diet rich in eggs, nuts, oils, avocados, and other delicious super-foods. In his new book, bestselling author Dr. Mark Hyman introduces a new weight-loss and healthy living program based on the latest science and explains how to EAT FAT, GET THIN, and achieve optimum wellness along the way. Offering practical tools, meal plans, recipes, and shopping lists, as well as step-by-step, easy-to-follow advice, EAT FAT, GET THIN is the cutting edge way to lose weight, prevent disease, and feel your best.",
      "price": 15.39,
      "yearpublished": 2016,
      "pages": 400,
      "language": "English",
      "author": "Mark Hyman M.D",
      "categories": [
        "Cooking"
      ],
      "image": "/images/img-book-15.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 16,
      "name": "Food of the Italian South",
      "description": "In most cultures, exploring food means exploring history—and the Italian south has plenty of both to offer. The pasta-heavy, tomato-forward “Italian food” the world knows and loves does not actually represent the entire country; rather, these beloved and widespread culinary traditions hail from the regional cuisines of the south. Acclaimed author and food journalist Katie Parla takes you on a tour through these vibrant destinations so you can sink your teeth into the secrets of their rustic, romantic dishes.",
      "price": 18,
      "yearpublished": 2000,
      "pages": 299,
      "language": "English",
      "author": "Katie Parla",
      "categories": [
        "Cooking"
      ],
      "image": "/images/img-book-16.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 17,
      "name": "How to Change Your Mind",
      "description": "When Michael Pollan set out to research how LSD and psilocybin (the active ingredient in magic mushrooms) are being used to provide relief to people suffering from difficult-to-treat conditions such as depression, addiction and anxiety, he did not intend to write what is undoubtedly his most personal book. But upon discovering how these remarkable substances are improving the lives not only of the mentally ill but also of healthy people coming to grips with the challenges of everyday life, he decided to explore the landscape of the mind in the first person as well as the third.",
      "price": 19.04,
      "yearpublished": 2018,
      "pages": 480,
      "language": "English",
      "author": "Michael Pollan",
      "categories": [
        "Cooking",
        "Politics"
      ],
      "image": "/images/img-book-17.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 18,
      "name": "Bundle Collection: Danielle Steel",
      "description": "Paige Watts is the ultimate stage mother. The daughter of Hollywood royalty, Paige channels her acting dreams into making her own daughter, Emma, a star. By the age of nine, Emma is playing a central role in a hit TV show. Then everything is shattered by unforeseeable tragedy.",
      "price": 31,
      "yearpublished": 2018,
      "pages": 300,
      "language": "English",
      "author": "Danielle Steel",
      "categories": [
        "Drama",
        "Fiction",
        "Uncategorized"
      ],
      "image": "/images/img-book-18.png",
      "sale": true,
      "quantity": 1
    },
    {
      "id": 19,
      "name": "The Woman in the Window",
      "description": "For readers of Gillian Flynn and Tana French comes one of the decade's most anticipated debuts, published in forty-one languages around the world and in development as a major film from Fox: a twisty, powerful Hitchcockian thriller about an agoraphobic woman who believes she witnessed a crime in a neighboring house.",
      "price": 15,
      "yearpublished": 2018,
      "pages": 448,
      "language": "English",
      "author": "A. J. Finn",
      "categories": [
        "Drama",
        "Mystery"
      ],
      "image": "/images/img-book-19.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 20,
      "name": "Girl, Wash Your Face",
      "description": "With painful honesty and fearless humor, Rachel unpacks and examines the falsehoods that once left her feeling overwhelmed and unworthy, and reveals the specific practical strategies that helped her move past them. In the process, she encourages, entertains, and even kicks a little butt, all to convince you to do whatever it takes to get real and become the joyous, confident woman you were meant to be.",
      "price": 9.99,
      "yearpublished": 2018,
      "pages": 251,
      "language": "English",
      "author": "Rachels Hollis",
      "categories": [
        "Family"
      ],
      "image": "/images/img-book-20.png",
      "sale": true,
      "quantity": 1
    },
    {
      "id": 21,
      "name": "The Subtle Art of Not Giving a F*ck",
      "description": "In this generation-defining self-help guide, a superstar blogger cuts through the crap to show us how to stop trying to be “positive” all the time so that we can truly become better, happier people.",
      "price": 14.95,
      "yearpublished": 2016,
      "pages": 212,
      "language": "English",
      "author": "Mark Manson",
      "categories": [
        "Family"
      ],
      "image": "/images/img-book-21.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 22,
      "name": "Waiting for Eden: A Novel",
      "description": "Eden Malcom lies in a bed, unable to move or to speak, imprisoned in his own mind. His wife Mary spends every day on the sofa in his hospital room. He has never even met their young daughter. And he will never again see the friend and fellow soldier who didn't make it back home and who narrates the novel. But on Christmas, the one day Mary is not at his bedside, Eden's re-ordered consciousness comes flickering alive. As he begins to find a way to communicate, some troubling truths about his marriage and about his life before he went to war come to the surface. Is Eden the same man he once was: a husband, a friend, a father-to-be? What makes a life worth living? A piercingly insightful, deeply felt meditation on loyalty and betrayal, love and fear, Waiting for Eden is a tour de force of profound humanity.",
      "price": 13.87,
      "yearpublished": 2018,
      "pages": 192,
      "language": "English",
      "author": "Elliot Ackerman",
      "categories": [
        "Family"
      ],
      "image": "/images/img-book-22.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 23,
      "name": "12 Rules for Life: An Antidote to Chaos",
      "description": "Humorous, surprising and informative, Dr. Peterson tells us why skateboarding boys and girls must be left alone, what terrible fate awaits those who criticize too easily, and why you should always pet a cat when you meet one on the street.",
      "price": 9.95,
      "yearpublished": 2018,
      "pages": 250,
      "language": "English",
      "author": "Jordan B. Peterson",
      "categories": [
        "Fiction",
        "Politics"
      ],
      "image": "/images/img-book-23.png",
      "sale": true,
      "quantity": 1
    },
    {
      "id": 24,
      "name": "Before We Were Yours",
      "description": "Based on one of America's most notorious real-life scandals—in which Georgia Tann, director of a Memphis-based adoption organization, kidnapped and sold poor children to wealthy families all over the country—Lisa Wingate's riveting, wrenching, and ultimately uplifting tale reminds us how, even though the paths we take can lead to many places, the heart never forgets where we belong.",
      "price": 10.62,
      "yearpublished": 2018,
      "pages": 480,
      "language": "English",
      "author": "Lisa Wingate",
      "categories": [
        "Family",
        "History"
      ],
      "image": "/images/img-book-24.png",
      "sale": true,
      "quantity": 1
    },
    {
      "id": 25,
      "name": "Where the Crawdads Sing",
      "description": "For years, rumors of the “Marsh Girl” have haunted Barkley Cove, a quiet town on the North Carolina coast. So in late 1969, when handsome Chase Andrews is found dead, the locals immediately suspect Kya Clark, the so-called Marsh Girl.",
      "price": 16.2,
      "yearpublished": 2018,
      "pages": 448,
      "language": "English",
      "author": "Delia Owens",
      "categories": [
        "Fiction",
        "Uncategorized"
      ],
      "image": "/images/img-book-25.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 26,
      "name": "The River: A Novel",
      "description": "Wynn and Jack have been best friends since freshman orientation, bonded by their shared love of mountains, books, and fishing. Wynn is a gentle giant, a Vermont kid never happier than when his feet are in the water. Jack is more rugged, raised on a ranch in Colorado where sleeping under the stars and cooking on a fire came as naturally to him as breathing. When they decide to canoe the Maskwa River in northern Canada, they anticipate long days of leisurely paddling and picking blueberries, and nights of stargazing and reading paperback Westerns. But a wildfire making its way across the forest adds unexpected urgency to the journey. When they hear a man and woman arguing on the fog-shrouded riverbank and decide to warn them about the fire, their search for the pair turns up nothing and no one. But: The next day a man appears on the river, paddling alone. Is this the man they heard? And, if he is, where is the woman? From this charged beginning, master storyteller Peter Heller unspools a headlong, heart-pounding story of desperate wilderness survival.",
      "price": 29.99,
      "yearpublished": 2018,
      "pages": 250,
      "language": "English",
      "author": "Peter Hellers",
      "categories": [
        "Fiction"
      ],
      "image": "/images/img-book-26.png",
      "sale": true,
      "quantity": 1
    },
    {
      "id": 27,
      "name": "Big Week: The Biggest Air Battle of World War II",
      "description": "During the third week of February 1944, the combined Allied air forces based in Britain and Italy launched their first round-the-clock bomber offensive against Germany. Their goal: to smash the main factories and production centers of the Luftwaffe while also drawing German planes into an aerial battle of attrition to neutralize the Luftwaffe as a fighting force prior to the cross-channel invasion, planned for a few months later. Officially called Operation ARGUMENT, this aerial offensive quickly became known as “Big Week,” and it was one of the turning-point engagements of World War II.",
      "price": 18.3,
      "yearpublished": 2000,
      "pages": 400,
      "language": "English",
      "author": "James Holland",
      "categories": [
        "History"
      ],
      "image": "/images/img-book-27.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 28,
      "name": "Say Nothing",
      "description": "In December 1972, Jean McConville, a thirty-eight-year-old mother of ten, was dragged from her Belfast home by masked intruders, her children clinging to her legs. They never saw her again. Her abduction was one of the most notorious episodes of the vicious conflict known as The Troubles. Everyone in the neighborhood knew the I.R.A. was responsible. But in a climate of fear and paranoia, no one would speak of it. In 2003, five years after an accord brought an uneasy peace to Northern Ireland, a set of human bones was discovered on a beach. McConville's children knew it was their mother when they were told a blue safety pin was attached to the dress with so many kids, she had always kept it handy for diapers or ripped clothes.",
      "price": 18.87,
      "yearpublished": 2019,
      "pages": 464,
      "language": "English",
      "author": "Patrick Radden Keefe",
      "categories": [
        "Biography",
        "Mystery"
      ],
      "image": "/images/img-book-28.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 29,
      "name": "A Brief History of Time",
      "description": "A landmark volume in science writing by one of the great minds of our time, Stephen Hawking's book explores such profound questions as: How did the universe begin—and what made its start possible? Does time always flow forward? Is the universe unending—or are there boundaries? Are there other dimensions in space? What will happen when it all ends?",
      "price": 21.51,
      "yearpublished": 1998,
      "pages": 221,
      "language": "English",
      "author": "Stephen Hawking",
      "categories": [
        "Mystery"
      ],
      "image": "/images/img-book-29.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 30,
      "name": "Fire and Fury: Inside the Trump White House",
      "description": "With extraordinary access to the West Wing, Michael Wolff reveals what happened behind-the-scenes in the first nine months of the most controversial presidency of our time in Fire and Fury: Inside the Trump White House.",
      "price": 14.9,
      "yearpublished": 2018,
      "pages": 312,
      "language": "English",
      "author": "Michael Wolf",
      "categories": [
        "Family"
      ],
      "image": "/images/img-book-30.png",
      "sale": false,
      "quantity": 1
    },
    {
      "id": 31,
      "name": "Winter Loon: A Novel",
      "description": "Abandoned by his father after his mother drowns in a frozen Minnesota lake, fifteen-year-old Wes Ballot is stranded with coldhearted grandparents and holed up in his mother's old bedroom, surrounded by her remnants and memories. As the wait for his father stretches unforgivably into months, a local girl, whose own mother died a brutal death, captures his heart and imagination, giving Wes fresh air to breathe in the suffocating small town.",
      "price": 11,
      "yearpublished": 2018,
      "pages": 350,
      "language": "English",
      "author": "Susan Bernhard",
      "categories": [
        "Fiction",
        "Uncategorized"
      ],
      "image": "/images/img-book-31.png",
      "sale": true,
      "quantity": 1
    },
    {
      "id": 32,
      "name": "The Traitor's Niche: A Novel",
      "description": "At the heart of the Ottoman Empire, in the main square of Constantinople, a niche is carved into ancient stone. Here, the sultan displays the severed heads of his adversaries. People flock to see the latest head and gossip about the state of the empire: the province of Albania is demanding independence again, and the niche awaits a new trophy…",
      "price": 16.93,
      "yearpublished": 2018,
      "pages": 400,
      "language": "English",
      "author": "Ismail Kadare",
      "categories": [
        "History",
        "Uncategorized"
      ],
      "image": "/images/img-book-32.png",
      "sale": false,
      "quantity": 1
    }
  ],
  "comments": [
    {
      "id": 1,
      "username": "john_smith",
      "text": "Great product, I would definitely recommend it to others!",
      "rating": 5,
      "date": "2022-01-10"
    },
    {
      "id": 2,
      "username": "jane_doe",
      "text": "I'm really impressed with the customer service, they went above and beyond to help me out!",
      "rating": 4,
      "date": "2022-02-15"
    },
    {
      "id": 3,
      "username": "sam_wilson",
      "text": "The product arrived on time and was exactly what I was looking for.",
      "rating": 4,
      "date": "2022-03-01"
    },
    {
      "id": 4,
      "username": "emily_jones",
      "text": "I had a problem with my order, but the customer service team was quick to resolve it.",
      "rating": 3,
      "date": "2022-04-10"
    },
    {
      "id": 5,
      "username": "mike_johnson",
      "text": "I was disappointed with the quality of the product, it wasn't what I was expecting.",
      "rating": 2,
      "date": "2022-05-20"
    },
    {
      "id": 6,
      "username": "susan_lee",
      "text": "The product is great, but it took a long time to arrive.",
      "rating": 4,
      "date": "2022-06-15"
    },
    {
      "id": 7,
      "username": "jacob_taylor",
      "text": "I'm very happy with my purchase, the product is exactly what I needed.",
      "rating": 5,
      "date": "2022-07-01"
    },
    {
      "id": 8,
      "username": "olivia_smith",
      "text": "The product was damaged during shipping, but the customer service team was helpful in getting me a replacement.",
      "rating": 3,
      "date": "2022-08-10"
    },
    {
      "id": 9,
      "username": "david_kim",
      "text": "I haven't had a chance to use the product yet, but it looks great!",
      "rating": 4,
      "date": "2022-09-01"
    },
    {
      "id": 10,
      "username": "sophia_wang",
      "text": "I'm satisfied with my purchase, but I wish the product came with more instructions.",
      "rating": 3,
      "date": "2022-10-15"
    }
  ],
  "posts": [
    {
      "id": 1,
      "title": "I was paid $12,500 to write my book. Here's why I'm revealing that",
      "author": "Sarah Johnson",
      "content": "In today's fast-paced world, productivity is key to success. Here are 10 tips to help you boost your productivity and get more done in less time.",
      "date": "2022-01-01"
    },
    {
      "id": 2,
      "title": "The Benefits of Meditation",
      "author": "David Lee",
      "content": "Meditation has been shown to have numerous benefits for both the mind and body. In this post, we explore some of the top benefits of meditation and how you can get started.",
      "date": "2022-02-01"
    },
    {
      "id": 3,
      "title": "The Top 5 Destinations for Adventure Travel",
      "author": "Alexa Chen",
      "content": "Are you an adventure seeker? If so, check out our list of the top 5 destinations for adventure travel. From hiking in the mountains to exploring exotic locales, these destinations have it all!",
      "date": "2022-03-01"
    },
    {
      "id": 4,
      "title": "The Importance of Eating a Healthy Diet",
      "author": "John Smith",
      "content": "Eating a healthy diet is essential for maintaining good health and preventing chronic diseases. In this post, we explore the importance of eating a healthy diet and provide tips for making healthy food choices.",
      "date": "2022-04-01"
    },
    {
      "id": 5,
      "title": "How to Build Strong Relationships",
      "author": "Emily Davis",
      "content": "Strong relationships are key to happiness and success in life. In this post, we explore how to build strong relationships with family, friends, and coworkers, and why it's important to do so.",
      "date": "2022-05-01"
    }
  ],
  "login": [
    {
      "id": 1,
      "username": "ngtuananh@gmail.com",
      "password": "14112001",
      "role": "client"
    },
    {
      "id": 2,
      "username": "admin",
      "password": "12345",
      "role": "admin"
    }
  ],
  "blog": [
    {
      "id": 1,
      "title": "I was paid $12,500 to write my book. Here’s why I’m revealing that",
      "image": "/public/images/img-blog-1.jpg",
      "content": "The more we know about what other people earn, the more we can understand our own circumstances I was paid a $12,500 advance to write my book, Open Up. Sharing this publicly,…",
      "date": "APRIL 4 ,2019",
      "categories": [
        "NEWS"
      ]
    },
    {
      "id": 2,
      "title": "Should You Feel Embarrassed for Reading Kids Books?",
      "image": "/public/images/img-blog-2.jpg",
      "content": "Read whatever you want. But you should feel embarrassed when what you’re reading was written for children. Reprehenderit tempor aliquip dolor eiusmod nostrud quis ipsum qui aliquip nostrud tempor aute tempor commodo.…",
      "date": "APRIL 4 ,2019",
      "categories": [
        "NEWS",
        "OPINION"
      ]
    },
    {
      "id": 3,
      "title": "A Lost 'Little Boy' Nears 100: Poet And Publisher Lawrence Ferlinghetti",
      "image": "/public/images/img-blog-3.jpg",
      "content": "For Lawrence Ferlinghetti, living to be 100 is no fun. Speaking from his home in San Francisco recently, Ferlinghetti said he's practically blind now — he can't read, and he's skipping his…",
      "date": "MARCH 4 ,2023",
      "categories": [
        "OPINION"
      ]
    },
    {
      "id": 4,
      "title": "A Lost 'Little Boy' Nears 100: Poet And Publisher Lawrence Ferlinghetti",
      "image": "/public/images/img-blog-4.jpg",
      "content": "As the holiday shopping season swings into full force, it’s interesting to watch people buying books. Many a wish list has everything from the latest by Stephen King to an Amazon Gift Card…",
      "date": "DEC 14, 2023",
      "categories": [
        "NEWS"
      ]
    },
    {
      "id": 5,
      "title": "A New Restaurant & Bookshop Opens in Raleigh",
      "image": "/public/images/img-blog-5.jpg",
      "content": "Brewery Bhavana, a restaurant in downtown Raleigh offering craft beer and dim sum, plus a flower shop and bookstore, opened last Wednesday, the News & Observer reported, noting that the bookshop and floral shop inside…",
      "date": "NOV 14, 2023",
      "categories": [
        "NEWS"
      ]
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "fiction",
      "image": "/images/fiction_icon.webp"
    },
    {
      "id": 2,
      "name": "history",
      "image": "/images/history_icon.webp"
    },
    {
      "id": 3,
      "name": "mystery",
      "image": "/images/mystery_icon.webp"
    },
    {
      "id": 4,
      "name": "family",
      "image": "/images/family_icon.webp"
    },
    {
      "id": 5,
      "name": "cooking",
      "image": "/images/cooking_icon.webp"
    },
    {
      "id": 6,
      "name": "drama",
      "image": "/images/drama_icon.webp"
    }
  ] 
}